<?php
/**
 * Created by PhpStorm.
 * User: smallzz
 * Date: 2018/11/13
 * Time: 上午11:14
 */
#后端code码 30000 - 50000
$afterCode = [
    #后端公共码
    #30000 => '', #错误公共返回
    30001 => '非法请求',
    30002 => '参数错误',

    30100 => '请求成功',
    30101 => '请求失败',
    30102 => '添加成功',
    30103 => '添加失败',
    30104 => '编辑成功',
    30105 => '编辑失败',
    30106 => '删除成功',
    30107 => '删除失败',
    30108 => '禁用成功',
    30109 => '禁用失败',
    30110 => '操作成功',
    30111 => '操作失败',


];
#前端code码 10000 - 29999
$before = [


];

return $afterCode+$before;